<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"d0ecd6d754d9a3ffedc588e96fb9e203fbf6771a90e93d2ef2efe84b3e978ffb","plan_job_ref":"Job Plan Airflow DAGs #455 at https://github.com/cal-itp/data-infra/actions/runs/16841898562","plan_out_hash":"7ea52d8f7eed2caed948e4d90726733f3f09b8f97cd906ca8bbda9d965413fc7","plan_hash":"070bda6870fbc0b12ad3b68a7cd32eba7c7507d878e32f1105b0c51e837dc89b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "YEdMtg==" -> (known after apply)
!~      detect_md5hash      = "0S3vYVJfgvy+Uvxzc6K9rQ==" -> "different hash"
!~      generation          = 1754523276734020 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "0S3vYVJfgvy+Uvxzc6K9rQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/_macros.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/macros/_macros.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/macros/_macros.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "epCRLA==" -> (known after apply)
!~      detect_md5hash      = "bacekMXdBMZQmW8HYyESKQ==" -> "different hash"
!~      generation          = 1754523278088632 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "bacekMXdBMZQmW8HYyESKQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #455](https://github.com/cal-itp/data-infra/actions/runs/16841898562)